In [48]:
import pandas as pd
from sklearn import linear_model

In [49]:
df=pd.read_csv("Real estate.csv",usecols=['X5 latitude','X2 house age'])
df

     X2 house age  X5 latitude
0            32.0     24.98298
1            19.5     24.98034
2            13.3     24.98746
3            13.3     24.98746
4             5.0     24.97937
..            ...          ...
409          13.7     24.94155
410           5.6     24.97433
411          18.8     24.97923
412           8.1     24.96674
413           6.5     24.97433

[414 rows x 2 columns]

In [50]:
new_df=df.rename(columns= {"X2 house age": "age",
"X5 latitude":"latitude"})

In [51]:
new_df

      age  latitude
0    32.0  24.98298
1    19.5  24.98034
2    13.3  24.98746
3    13.3  24.98746
4     5.0  24.97937
..    ...       ...
409  13.7  24.94155
410   5.6  24.97433
411  18.8  24.97923
412   8.1  24.96674
413   6.5  24.97433

[414 rows x 2 columns]

In [52]:
new_df

      age  latitude
0    32.0  24.98298
1    19.5  24.98034
2    13.3  24.98746
3    13.3  24.98746
4     5.0  24.97937
..    ...       ...
409  13.7  24.94155
410   5.6  24.97433
411  18.8  24.97923
412   8.1  24.96674
413   6.5  24.97433

[414 rows x 2 columns]

In [53]:
age=new_df.drop('age',axis=1)

In [54]:
model=linear_model.LinearRegression()

In [56]:
model.fit(age,new_df.latitude)

LinearRegression()

In [57]:
model.predict([[18]])

array([18.])